Ran Plan for dir: `environment/test` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.2 plan -input=false -refresh -out "/atlantis-data/repos/shwetaec12/eks-atlantis-demo/7/default/environment/test/default.tfplan"' in '/atlantis-data/repos/shwetaec12/eks-atlantis-demo/7/default/environment/test': exit status 1
aws_iam_openid_connect_provider.oidc: Refreshing state... [id=arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/my-eks-cluster/cluster]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-081634630e685f114]
data.aws_iam_policy_document.eks_node_group_assume: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy_document.eks_node_group_assume: Read complete after 0s [id=2851119427]
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.node_group_role: Refreshing state... [id=eks-node-group-role]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=895976263444]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=my-eks-cluster-cluster-20250614224333158500000001]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0f03912c2625eea8c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b83fcdbfbda8f876]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b8db7d5e381350a2]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-088c8f48170d1defb]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0aab18f3a50899e18]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0881176a6b1001a34]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749951561405622177]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bf86a31f4465abe2]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0c72d63916e775881]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06e51e0f451c2c736]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-096167c3422310cbb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0974462f1d0d2c920]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-09743406c6aa2162d]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03b0c90190b9bb3ee]
aws_iam_role.atlantis_irsa_role: Refreshing state... [id=atlantis-irsa-role]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bf86a31f4465abe21080289494]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3620973335]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-253355197]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2930060334]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1978082952]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2631713486]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2364478894]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1458654745]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-844135890]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1168994872]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-184192961]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03a8d26adecc5f467]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f285f17474cb40f6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-079517ece3bf07df8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ec1e99e6e75e8cbc]
aws_iam_role_policy.node_group_extra_access: Refreshing state... [id=eks-node-group-role:extra-node-group-access]
aws_iam_role_policy_attachment.node_group_cni_policy: Refreshing state... [id=eks-node-group-role-20250614224333983300000003]
aws_iam_role_policy_attachment.node_group_ecr_readonly: Refreshing state... [id=eks-node-group-role-20250614224333996800000005]
aws_iam_role_policy_attachment.node_group_worker_node: Refreshing state... [id=eks-node-group-role-20250614224333988400000004]
aws_iam_role_policy_attachment.node_group_admin_access: Refreshing state... [id=eks-node-group-role-20250614224333970000000002]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=my-eks-cluster-cluster-20250614224333158500000001-20250614224334176000000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=my-eks-cluster-cluster-20250614224333158500000001-20250614224334218900000009]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3149980475]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f3d20ac6e19be178]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=895976263444]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3189769992]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=2b6949e9-eed9-46d6-be6a-45b365979e74]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250614224334082700000006]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b83fcdbfbda8f8761080289494]
aws_iam_role_policy_attachment.eks_admin_attach: Refreshing state... [id=eks-admin-20250614224334114500000007]
aws_iam_role_policy.atlantis_policy: Refreshing state... [id=atlantis-irsa-role:atlantis-iam-policy]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250614224334082700000006-2025061422433467210000000c]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250614224334082700000006-2025061422433464350000000b]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250614224334082700000006-2025061422433462110000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.atlantis_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "atlantis_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:default:atlantis-new",
                ]
              + variable = "oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F",
                ]
              + type        = "Federated"
            }
        }
    }

  # data.aws_iam_policy_document.eks_admin_assume will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eks_admin_assume" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F",
                ]
              + type        = "Federated"
            }
        }
    }

  # aws_iam_openid_connect_provider.oidc will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc" {
        id              = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F"
      ~ tags            = {
          - "Environment" = "production" -> null
          - "Name"        = "my-eks-cluster-eks-irsa" -> null
        }
      ~ tags_all        = {
          - "Environment" = "production" -> null
          - "Name"        = "my-eks-cluster-eks-irsa" -> null
        }
      ~ thumbprint_list = [
          ~ "06b25927c42a721631c1efd9431e648fa62e1e39" -> "9e99a48a9960b14926bb7f3b02e22da0cbed5e11",
        ]
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.atlantis_irsa_role will be updated in-place
  ~ resource "aws_iam_role" "atlantis_irsa_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F:sub" = "system:serviceaccount:default:atlantis-new"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "atlantis-irsa-role"
        name                  = "atlantis-irsa-role"
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role.eks_admin will be updated in-place
  ~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::895976263444:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/C73BE2AE0D7D948ADA92A8E0DDAA1D3F"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│ 
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵
╷
│ Error: reading KMS Key (2b6949e9-eed9-46d6-be6a-45b365979e74): reading KMS Key (2b6949e9-eed9-46d6-be6a-45b365979e74): operation error KMS: DescribeKey, https response error StatusCode: 400, RequestID: 61c434f5-44a5-48a4-89b8-2bc0565ac231, api error AccessDeniedException: User: arn:aws:sts::895976263444:assumed-role/atlantis-irsa-role/1749951561405622177 is not authorized to perform: kms:DescribeKey on resource: arn:aws:kms:eu-central-1:895976263444:key/2b6949e9-eed9-46d6-be6a-45b365979e74 because no resource-based policy allows the kms:DescribeKey action
│ 
│   with module.eks.module.kms.aws_kms_key.this[0],
│   on .terraform/modules/eks.kms/main.tf line 18, in resource "aws_kms_key" "this":
│   18: resource "aws_kms_key" "this" {
│ 
╵

```
</details>